# -*- coding: utf-8; -*-

** 연락처 
   ftp://ftp.gnu.org/old-gnu/Manuals/elisp-manual-20-2.5/html_chapter/elisp_17.html
   참조

   <2020-01-17 금 16:23> 김동일 함수명 변경
   debugging - (insert (format "%s" mu4e~contacts))
   #+BEGIN_SRC emacs-lisp
     ;;(defadvice mu4e~update-contacts (before mu4e~contacts-filter activate)
     ;;  (ad-set-arg
     ;;   0
     ;;   (-filter
     ;;    (lambda (x)
     ;;      (s-equals? "hanwhasystems.com" (cadr  (s-split "@" (car x ))))) (ad-get-arg 0))))

     (defadvice mu4e~update-contacts (before mu4e~contacts-filter activate)
       (ad-set-arg
        0
        (-filter
         (lambda (x)
           (s-contains? "hanwhasystems.com" (car x ))) (ad-get-arg 0))))

   #+END_SRC

   #+RESULTS:
   : mu4e~update-contacts


  
